chars = [ch for ch in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..',
         '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.',
         '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----',
         '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']
work_map = dict(zip(chars, morse))

print(*[work_map.get(ch) for ch in input("Введите ваш текст: ").upper() if ch.isalnum() if work_map.get(ch)])
